"""
    HTML - структуру и разметку страницы, это стандартизированы язык гипер текстовой разметки
который создает каркас веб страницы также задает структуру контента.
    Основные функции:
    1 Создание структуры страницы
    2 Упорядочивание информации
    3 Связывание ресурсов (скрипты)
    4 Обеспечение семантики
    CSS - это каскадная таблица стилей которая добавляет веб страницу стили и красоту.
    Основные функции:
    1 Стилизация текста
    2 Оформление фона
    3 Расположение элементом
    4 Адаптивность (удобство для разных устройств: телефонов, компьютеров и т.д.)
    Движки браузеров:
    Blink - Chrome, Edge, Opera, яндекс?
    WebKit - браузер Safari
    Gecko - Firefox
    HTML состоит:
    <html> - все содержимое страницы должно находиться в него
    <head> - содержит информацию, которая отображается для страницы, но важна для информации
    <body> - содержит весь содержимый контент страницы
    <h1> - заголовок
    <p> - параграфы используется для написания текста
    <a> - ссылки, позволяют переходить на другие страницы
    <img src=""> - ссылка или уже имеющая картинка
    <div> - разделы
    <span> - выделение отдельных строк и элементов
    Советы:
    1 использовать отступы
    2 закрывать все теги
    3 следите чтоб каждый тег использовался по собственному значению
    Принципы CSS
    селекторы - это часть кода которые говорит браузеру какой применить элемент.
    Основные принципы:
    1 разделение структуры и стилей
    2 иерархия и приоритет
    3 повторное использование
    Стили:
    1 связанный стиль (ссылка на файл)
    2 глобальный стиль (в основном коде)
    3 внутрении (в нутри строки) (первее используется)
    Селекты:
    1 по тегу
    2 по классу



"""